name: 'deconv4_1'

input: 'data'
input_dim: 1
input_dim: 512
input_dim: 28
input_dim: 28

layers {
	type: DECONVOLUTION
	name: 'deconv'
	bottom: 'data'
	top: 'deconv'
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
	}
}
