name: 'deconv3_3'

input: 'data'
input_dim: 1
input_dim: 256
input_dim: 56
input_dim: 56

layers {
	type: DECONVOLUTION
	name: 'deconv'
	bottom: 'data'
	top: 'deconv'
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
	}
}
