name: 'deconv1_1'

input: 'data'
input_dim: 1
input_dim: 64
input_dim: 224
input_dim: 224

layers {
	type: DECONVOLUTION
	name: 'deconv'
	bottom: 'data'
	top: 'deconv'
	convolution_param {
		num_output: 3
		kernel_size: 3
		pad: 1
		stride: 1
	}
}
